Mermaid + Minor fixes
Signed-off-by: mayuka-c <Mayuka.C@ibm.com>
